{
  "en": {
    "title": "7-Week Character Building Journey",
    "subtitle": "Based on \"It's Better to Build Boys Than Mend Men\" by S. Truett Cathy",
    "personalized": "Personalized for Elias, Lucas, Miriam & Cati",
    "week": "Week",
    "overall_progress": "Overall Progress",
    "complete_percent": "0% Complete",
    "sessions": "0/196 sessions",
    "week1_title": "Week 1: Changing a Child Changes You",
    "week1_subtitle": "Building the Foundation of Love and Connection",
    "elias_activities": "For Elias (7, shy, emotional, loves hugs):",
    "daily_hugs": "Daily hugs ritual",
    "hug_times": "3 specific hug times - morning, after school, bedtime",
    "brave_moments": "Brave moments",
    "brave_description": "Each day, acknowledge one \"brave\" thing he did (even small ones)",
    "nighttime_routine": "Nighttime routine",
    "night_description": "Special bedtime prayers together, night light with timer",
    "breathing_games": "Breathing games",
    "bubbles_description": "Blow bubbles (great for asthma!) - see who can make the biggest bubble",
    "wrestling_time": "Wrestling time",
    "knight_training": "10 minutes of gentle \"knight training\" with foam swords after school",
    "lucas_activities": "For Lucas (9, independent, athletic, observant):",
    "man_time": "Man-to-man time",
    "talk_time": "15 minutes daily of just talking - let him lead the conversation",
    "football_training": "Football training",
    "lung_capacity": "Practice skills that build lung capacity (dribbling, short sprints)",
    "observation_game": "Observation game",
    "behavior_notice": "Ask him what he noticed about people's behavior that day",
    "respect_handshake": "Respect handshake",
    "handshake_practice": "Teach firm handshake, practice daily",
    "problem_solving": "Problem-solving",
    "family_decisions": "Give him small family decisions to help with",
    "miriam_activities": "For Miriam (3, cuddly, learning to talk):",
    "cuddle_reading": "Cuddle reading",
    "picture_books": "20 minutes of picture books together daily",
    "simple_words": "Simple words",
    "family_names": "Practice saying family names clearly",
    "helper_tasks": "Helper tasks",
    "sorting_socks": "Let her \"help\" with simple chores (sorting socks by color)",
    "dance_parties": "Dance parties",
    "coordination": "10 minutes of dancing to build coordination",
    "family_activities_title": "Family Activities:",
    "family_motto": "Family motto",
    "create_motto": "Create a simple family motto together",
    "dinner_conversations": "Dinner conversations",
    "good_thing": "Each person shares one good thing from their day",
    "weekend_adventure": "Weekend adventure",
    "outdoor_activity": "One small outdoor activity together",
    "day": "Day",
    "daily_tracker": "Daily Daddy Time Tracker (1 Hour Total)",
    "min_with": "15 min with",
    "prayer_hugs": "prayer & hugs",
    "from_book": "From the Book: The Power of Fatherly Love",
    "from_book_2": "From the Book: The Example of a Loving Father",
    "from_book_3": "From the Book: Chapter 1 - Part 3",
    "from_book_4": "From the Book: Chapter 1 - Part 4",
    "from_book_5": "From the Book: Chapter 1 - Part 5",
    "from_book_6": "From the Book: Chapter 1 - Part 6",
    "from_book_7": "From the Book: Chapter 1 - Part 7",
    "book_excerpt_1": "God wants to work through you to change the life of a child. He will provide the love, the encouragement, the joy, and the hope. All you have to contribute are arms for hugs, a voice to encourage or to discipline, and time for companionship. You don't have to look far to find the child. In fact, your paths will probably cross this week. And when you reach out, your reward will be immeasurable. Every child God touches through you will be changed, even if you don't see the transformation with your own eyes. And you will be changed by every child God touches through you.",
    "book_excerpt_2": "Then Theo Abby became my teacher and my friend. Occasionally he visited the federal housing project where I lived to see me and other boys in our class, and he invited us to go with him and his son Ted to his lakeside cabin. There he modeled with Ted a loving father-son relationship. As an adult I remembered Mr. Abby's example and decided to teach boys in Sunday school. Like Mr. Abby, I kept in touch with the boys through the week by inviting the entire class to be my guests at the Dwarf House, my first restaurant, one night a week.",
    "book_excerpt_3": "Children all around us are growing up without strong positive guidance from their parents, who are busy, distracted, absent, or choose to be buddies instead of parents to their children. You see these boys and girls playing with your children or grandchildren, or in your church, or in your classroom or Scout troop. They're a bit quieter or a bit more rambunctious or a bit different from the other children.",
    "book_excerpt_4": "Every idea that works has its basis in Scripture. Many of the lessons in this book come from Proverbs 22, from which I drew my life verse seventy years ago: \"A good name is rather to be chosen than great riches, and loving favour rather than silver and gold.\" The best thing you can do to help a child is follow your instinct and God's leading.",
    "book_excerpt_5": "I hope the thoughts and illustrations in this book help you in particular situations, but the best thing you can do to help a child is follow your instinct and God's leading. Reach out to children sincerely. Reach out in love. Love children into a sense of belonging. Let a child know you care and you're available to talk—to be a friend.",
    "book_excerpt_6": "God wants to work through you to change the life of a child. Make yourself available to Him, and He may bless you with the opportunity to watch Him build and transform a life. The power to influence a child's life is within your reach. You may not feel equipped or worthy, but God has placed these children in your path for a purpose.",
    "book_excerpt_7": "Remember that the influence you have on a child today will ripple through generations. The boy or girl you encourage, guide, and love will become the parent, teacher, coach, or mentor who influences other children. Your investment multiplies exponentially. The child you build today may build dozens of other children throughout their lifetime.",
    "continue_building": "Continue building daily routines and connections with each child...",
    "focus_individual": "Focus on deepening individual connections with each child through their preferred activities...",
    "prepare_weekend": "Prepare for weekend family activities and reflect on the week's progress...",
    "weekend_focus": "Weekend focus: Special family time and individual activities with each child...",
    "week1_reflection": "Week 1 reflection: Celebrate progress and prepare for Week 2...",
    "week2_title": "Week 2: Respect",
    "week2_content": "Content for Week 2 goes here...",
    "week3_title": "Week 3: Trust & Generosity",
    "week3_content": "Content for Week 3 goes here...",
    "week4_title": "Week 4: Common Sense",
    "week4_content": "Content for Week 4 goes here...",
    "week5_title": "Week 5: Right Crowd",
    "week5_content": "Content for Week 5 goes here...",
    "week6_title": "Week 6: Stability",
    "week6_content": "Content for Week 6 goes here...",
    "week7_title": "Week 7: Good Name",
    "week7_content": "Content for Week 7 goes here...",
    "prev_week": "← Previous Week",
    "next_week": "Next Week →"
  },
  "ro": {
    "title": "Călătoria de 7 Săptămâni pentru Construirea Caracterului",
    "subtitle": "Bazat pe \"Mai bine să construiești băieți decât să repari bărbați\" de S. Truett Cathy",
    "personalized": "Personalizat pentru Elias, Lucas, Miriam și Cati",
    "week": "Săptămâna",
    "overall_progress": "Progres General",
    "complete_percent": "0% Complet",
    "sessions": "0/196 sesiuni",
    "week1_title": "Săptămâna 1: Schimbarea unui Copil te Schimbă pe Tine",
    "week1_subtitle": "Construirea Fundamentului de Iubire și Conexiune",
    "elias_activities": "Pentru Elias (7 ani, timid, emoțional, îi plac îmbrățișările):",
    "daily_hugs": "Ritualul îmbrățișărilor zilnice",
    "hug_times": "3 momente specifice pentru îmbrățișări - dimineața, după școală, la culcare",
    "brave_moments": "Momente de curaj",
    "brave_description": "În fiecare zi, recunoaște un lucru \"curajos\" pe care l-a făcut (chiar și cele mici)",
    "nighttime_routine": "Rutina de seară",
    "night_description": "Rugăciuni speciale împreună la culcare, lampă de veghe cu timer",
    "breathing_games": "Jocuri de respirație",
    "bubbles_description": "Faci baloane de săpun (excelent pentru astm!) - vezi cine face cea mai mare balon",
    "wrestling_time": "Timp de lupte",
    "knight_training": "10 minute de \"antrenament de cavaler\" blând cu săbii de spumă după școală",
    "lucas_activities": "Pentru Lucas (9 ani, independent, atletic, observator):",
    "man_time": "Timp de bărbat la bărbat",
    "talk_time": "15 minute zilnic doar de vorbit - lasă-l să conducă conversația",
    "football_training": "Antrenament de fotbal",
    "lung_capacity": "Exersează abilități care dezvoltă capacitatea pulmonară (dribling, sprinturi scurte)",
    "observation_game": "Jocul observației",
    "behavior_notice": "Întreabă-l ce a observat despre comportamentul oamenilor în ziua aceea",
    "respect_handshake": "Strângerea de mână respectuoasă",
    "handshake_practice": "Învață strângerea fermă de mână, exersează zilnic",
    "problem_solving": "Rezolvarea problemelor",
    "family_decisions": "Dă-i decizii mici de familie să ajute cu ele",
    "miriam_activities": "Pentru Miriam (3 ani, îi plac îmbrățișările, învață să vorbească):",
    "cuddle_reading": "Citit cu îmbrățișări",
    "picture_books": "20 de minute de cărți cu imagini împreună zilnic",
    "simple_words": "Cuvinte simple",
    "family_names": "Exersează să spună clar numele familiei",
    "helper_tasks": "Sarcini de ajutor",
    "sorting_socks": "Lasă-o să \"ajute\" cu treburi simple (sortarea șosetelor după culoare)",
    "dance_parties": "Petreceri de dans",
    "coordination": "10 minute de dans pentru a dezvolta coordonarea",
    "family_activities_title": "Activități de Familie:",
    "family_motto": "Motto-ul familiei",
    "create_motto": "Creați un motto simplu de familie împreună",
    "dinner_conversations": "Conversații la cină",
    "good_thing": "Fiecare persoană împărtășește un lucru bun din ziua lor",
    "weekend_adventure": "Aventura de weekend",
    "outdoor_activity": "O activitate mică în aer liber împreună",
    "day": "Ziua",
    "daily_tracker": "Urmăritor Zilnic Timp cu Tata (1 Oră în Total)",
    "min_with": "15 min cu",
    "prayer_hugs": "rugăciune și îmbrățișări",
    "from_book": "Din Carte: Puterea Iubirii Părintești",
    "from_book_2": "Din Carte: Exemplul unui Tată Iubitor",
    "from_book_3": "Din Carte: Capitolul 1 - Partea 3",
    "from_book_4": "Din Carte: Capitolul 1 - Partea 4",
    "from_book_5": "Din Carte: Capitolul 1 - Partea 5",
    "from_book_6": "Din Carte: Capitolul 1 - Partea 6",
    "from_book_7": "Din Carte: Capitolul 1 - Partea 7",
    "book_excerpt_1": "Dumnezeu vrea să lucreze prin tine pentru a schimba viața unui copil. El va oferi iubirea, încurajarea, bucuria și speranța. Tot ce trebuie să contribui sunt brațe pentru îmbrățișări, o voce pentru a încuraja sau disciplina, și timp pentru însoțire. Nu trebuie să cauți departe pentru a găsi copilul. De fapt, căile voastre se vor încrucișa probabil în această săptămână. Și când întinzi mâna, recompensa ta va fi incomensurabilă. Fiecare copil pe care Dumnezeu îl atinge prin tine va fi schimbat, chiar dacă nu vezi transformarea cu propriii ochi. Și vei fi schimbat de fiecare copil pe care Dumnezeu îl atinge prin tine.",
    "book_excerpt_2": "Apoi Theo Abby a devenit profesorul și prietenul meu. Ocazional mă vizita în complexul de locuințe federale unde locuiam să mă vadă pe mine și pe alți băieți din clasa noastră, și ne invita să mergem cu el și fiul său Ted la cabana lui de lângă lac. Acolo a modelat cu Ted o relație iubitoare tată-fiu. Ca adult mi-am amintit exemplul domnului Abby și am decis să predau băieților la școala duminicală. Ca domnul Abby, am ținut legătura cu băieții în timpul săptămânii invitând întreaga clasă să fie oaspeții mei la Dwarf House, primul meu restaurant, o seară pe săptămână.",
    "book_excerpt_3": "Copiii din jurul nostru cresc fără îndrumarea pozitivă puternică a părinților lor, care sunt ocupați, distrași, absenți, sau aleg să fie prieteni în loc de părinți pentru copiii lor. Îi vezi pe acești băieți și fete jucându-se cu copiii sau nepoții tăi, sau în biserica ta, sau în clasa ta sau trupa de cercetași. Sunt puțin mai liniștiți sau puțin mai agitați sau puțin diferiți de ceilalți copii.",
    "book_excerpt_4": "Fiecare idee care funcționează își are baza în Scriptură. Multe dintre lecțiile din această carte vin din Proverbele 22, din care mi-am extras versetul vieții cu șaptezeci de ani în urmă: \"Un nume bun este de preferat bogățiilor mari, și favoarea iubitoare mai mult decât argintul și aurul.\" Cel mai bun lucru pe care îl poți face pentru a ajuta un copil este să îți urmezi instinctul și îndrumarea lui Dumnezeu.",
    "book_excerpt_5": "Sper că gândurile și ilustrațiile din această carte te ajută în situații particulare, dar cel mai bun lucru pe care îl poți face pentru a ajuta un copil este să îți urmezi instinctul și îndrumarea lui Dumnezeu. Întinde mâna către copii cu sinceritate. Întinde mâna cu iubire. Iubește copiii până la un sentiment de apartenență. Lasă un copil să știe că îți pasă și că ești disponibil să vorbești - să fii un prieten.",
    "book_excerpt_6": "Dumnezeu vrea să lucreze prin tine pentru a schimba viața unui copil. Pune-te la dispoziția Lui, și El te poate binecuvânta cu oportunitatea de a-L vedea construind și transformând o viață. Puterea de a influența viața unui copil este la îndemâna ta. S-ar putea să nu te simți echipat sau demn, dar Dumnezeu a pus acești copii în calea ta cu un scop.",
    "book_excerpt_7": "Amintește-ți că influența pe care o ai asupra unui copil astăzi se va răspândi prin generații. Băiatul sau fata pe care îi încurajezi, îi ghidezi și îi iubești va deveni părintele, profesorul, antrenorul sau mentorul care influențează alți copii. Investiția ta se înmulțește exponențial. Copilul pe care îl construiești astăzi poate construi zeci de alți copii de-a lungul vieții lor.",
    "continue_building": "Continuă să construiești rutine zilnice și conexiuni cu fiecare copil...",
    "focus_individual": "Concentrează-te pe aprofundarea conexiunilor individuale cu fiecare copil prin activitățile lor preferate...",
    "prepare_weekend": "Pregătește-te pentru activitățile de familie de weekend și reflectează asupra progresului săptămânii...",
    "weekend_focus": "Focus weekend: Timp special de familie și activități individuale cu fiecare copil...",
    "week1_reflection": "Reflecția Săptămânii 1: Sărbătorește progresul și pregătește-te pentru Săptămâna 2...",
    "week2_title": "Săptămâna 2: Respect",
    "week2_content": "Conținutul pentru Săptămâna 2 va fi aici...",
    "week3_title": "Săptămâna 3: Încredere și Generozitate",
    "week3_content": "Conținutul pentru Săptămâna 3 va fi aici...",
    "week4_title": "Săptămâna 4: Bun Simț",
    "week4_content": "Conținutul pentru Săptămâna 4 va fi aici...",
    "week5_title": "Săptămâna 5: Grupul Potrivit",
    "week5_content": "Conținutul pentru Săptămâna 5 va fi aici...",
    "week6_title": "Săptămâna 6: Stabilitate",
    "week6_content": "Conținutul pentru Săptămâna 6 va fi aici...",
    "week7_title": "Săptămâna 7: Nume Bun",
    "week7_content": "Conținutul pentru Săptămâna 7 va fi aici...",
    "prev_week": "← Săptămâna Anterioară",
    "next_week": "Săptămâna Următoare →"
  }
}